In [2]:
import pandas as pd
import numpy as np
val1=pd.Series([1,2,1+np.nan,3,4])
print(val1.isnull())
print(val1.notnull())
print(val1.dropna())
print(val1.fillna(12))
print(val1.fillna(method='ffill'))
print(val1.fillna(method='bfill'))

0    False
1    False
2     True
3    False
4    False
dtype: bool
0     True
1     True
2    False
3     True
4     True
dtype: bool
0    1.0
1    2.0
3    3.0
4    4.0
dtype: float64
0     1.0
1     2.0
2    12.0
3     3.0
4     4.0
dtype: float64
0    1.0
1    2.0
2    2.0
3    3.0
4    4.0
dtype: float64
0    1.0
1    2.0
2    3.0
3    3.0
4    4.0
dtype: float64

/tmp/ipykernel_1072/1159819217.py:8: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(val1.fillna(method='ffill'))
/tmp/ipykernel_1072/1159819217.py:9: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(val1.fillna(method='bfill'))

In [3]:
missdata=pd.read_csv('president_heights1.csv')


# print(missdata.dropna())
# print(missdata.fillna(12))
# print(missdata.fillna(method='ffill'))
print(missdata.fillna(method='bfill'))

    order                    name  height(cm)
0       1       George Washington         189
1       2              John Adams         170
2       3        Thomas Jefferson         189
3       4           James Madison         163
4       5            James Monroe         183
5       6       John Quincy Adams         171
6       7          Andrew Jackson         185
7       8        Martin Van Buren         168
8       9  William Henry Harrison         173
9      10              John Tyler         183
10     11           James K. Polk         173
11     12          Zachary Taylor         173
12     13        Millard Fillmore         175
13     14         Franklin Pierce         178
14     15          James Buchanan         183
15     16         Abraham Lincoln         193
16     17          Andrew Johnson         178
17     18        Ulysses S. Grant         173
18     19     Rutherford B. Hayes         174
19     20       James A. Garfield         183
20     21       Chester A. Arthur         183
21     23       Benjamin Harrison         168
22     25        William McKinley         170
23     26      Theodore Roosevelt         178
24     27     William Howard Taft         182
25     28          Woodrow Wilson         180
26     29       Warren G. Harding         183
27     30         Calvin Coolidge         178
28     31          Herbert Hoover         182
29     32   Franklin D. Roosevelt         188
30     33         Harry S. Truman         175
31     34    Dwight D. Eisenhower         179
32     35         John F. Kennedy         183
33     36       Lyndon B. Johnson         193
34     37           Richard Nixon         182
35     38             Gerald Ford         183
36     39            Jimmy Carter         177
37     40           Ronald Reagan         185
38     41       George H. W. Bush         188
39     42            Bill Clinton         188
40     43          George W. Bush         182
41     44            Barack Obama         185

/tmp/ipykernel_1072/2504834736.py:7: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(missdata.fillna(method='bfill'))

In [4]:
missdata=pd.read_csv('president_heights2.csv')
print(missdata.head(20))

    order                    name  height(cm)
0       1       George Washington       189.0
1       2              John Adams       170.0
2       3        Thomas Jefferson       189.0
3       4           James Madison         NaN
4       5            James Monroe       183.0
5       6       John Quincy Adams       171.0
6       7          Andrew Jackson       185.0
7       8        Martin Van Buren       168.0
8       9  William Henry Harrison       173.0
9      10              John Tyler       183.0
10     11           James K. Polk       173.0
11     12          Zachary Taylor         NaN
12     13        Millard Fillmore       175.0
13     14         Franklin Pierce       178.0
14     15          James Buchanan         NaN
15     16         Abraham Lincoln       193.0
16     17          Andrew Johnson       178.0
17     18        Ulysses S. Grant       173.0
18     19     Rutherford B. Hayes         NaN
19     20       James A. Garfield       183.0

In [5]:
print(missdata.isnull())

    order   name  height(cm)
0   False  False       False
1   False  False       False
2   False  False       False
3   False  False        True
4   False  False       False
5   False  False       False
6   False  False       False
7   False  False       False
8   False  False       False
9   False  False       False
10  False  False       False
11  False  False        True
12  False  False       False
13  False  False       False
14  False  False        True
15  False  False       False
16  False  False       False
17  False  False       False
18  False  False        True
19  False  False       False
20  False  False       False
21  False  False        True
22  False  False       False
23  False  False       False
24  False  False       False
25  False  False       False
26  False  False       False
27  False  False       False
28  False  False       False
29  False  False       False
30  False  False       False
31  False  False       False
32  False  False       False
33  False  False       False
34  False  False       False
35  False  False       False
36  False  False       False
37  False  False       False
38  False  False       False
39  False  False       False
40  False  False       False
41  False  False       False

In [7]:
#Hierarchical indices
data = pd.read_csv('Q8_MortalityDataset.csv')
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 7 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AGE     200 non-null    int64
 1   HEIGHT  200 non-null    int64
 2   WEIGHT  200 non-null    int64
 3   CHOL    200 non-null    int64
 4   SMOKE   200 non-null    object
 5   BLOOD   200 non-null    object
 6   MORT    200 non-null    object
dtypes: int64(4), object(3)
memory usage: 11.1+ KB

In [9]:
data.describe()

              AGE     HEIGHT      WEIGHT        CHOL
count  200.000000  200.00000  200.000000  200.000000
mean    35.715000  172.35000   75.885000  233.600000
std      9.604426    6.77399   10.442076   44.766732
min     18.000000  156.00000   53.000000  107.000000
25%     28.750000  168.00000   68.750000  204.000000
50%     37.000000  172.00000   75.000000  232.000000
75%     42.000000  176.00000   82.000000  259.000000
max     58.000000  191.00000  110.000000  455.000000

In [12]:
data.shape
#numbers of rows and column

(200, 7)

In [14]:
morsample=data.sample(n=10)
print(morsample)

     AGE  HEIGHT  WEIGHT  CHOL   SMOKE BLOOD   MORT
37    34     172      71   217  sigare     o  alive
134   30     171      72   247    pipe     o  alive
159   40     170      81   206  sigare     o  alive
56    30     170      74   205  sigare     o  alive
109   36     170      81   190  nonsmo     o   dead
198   39     165      74   259  sigare     o  alive
174   20     177      81   230  nonsmo     o  alive
17    30     181      74   191  nonsmo     a  alive
110   40     183      73   178  sigare     b  alive
86    23     181      70   232    pipe     o  alive

In [16]:
morsample.iloc[0]

AGE           34
HEIGHT       172
WEIGHT        71
CHOL         217
SMOKE     sigare
BLOOD          o
MORT       alive
Name: 37, dtype: object

In [18]:
morsample.iloc[4:8,1:3]

     HEIGHT  WEIGHT
109     170      81
198     165      74
174     177      81
17      181      74

In [20]:
morsample.iloc[[0,1]]

     AGE  HEIGHT  WEIGHT  CHOL   SMOKE BLOOD   MORT
37    34     172      71   217  sigare     o  alive
134   30     171      72   247    pipe     o  alive

In [22]:
morh=morsample.groupby(['SMOKE','BLOOD','MORT']).mean()
morh

                      AGE  HEIGHT  WEIGHT    CHOL
SMOKE  BLOOD MORT
nonsmo a     alive  30.00  181.00    74.0  191.00
       o     alive  20.00  177.00    81.0  230.00
             dead   36.00  170.00    81.0  190.00
pipe   o     alive  26.50  176.00    71.0  239.50
sigare b     alive  40.00  183.00    73.0  178.00
       o     alive  35.75  169.25    75.0  221.75

In [24]:
morh=morsample.groupby(['SMOKE','BLOOD','MORT']).size()
morh

SMOKE   BLOOD  MORT
nonsmo  a      alive    1
        o      alive    1
               dead     1
pipe    o      alive    2
sigare  b      alive    1
        o      alive    4
dtype: int64